{
	"experience": [
		{
			"company": "Sony Interactive Entertainment (contract: DZX)",
			"title": "Software Development Engineer in Test",
			"startDate": {
				"year": 2021,
				"month": 4
			},
			"location": "Remote - Santa Fe, NM (office in Madison, WI)",
			"descriptions": [
				{
					"line": "Design, develop, and improve the usability of internal tools which are used to build online PlayStation digital commerce platforms.",
					"sublines": [
						"Provide feedback on stories’ acceptance criteria and direction during sprint planning ceremonies.",
						"Participate in frontend and backend code reviews."
					]
				},
				{
					"line": "Perform frontend and backend feature development work.",
					"sublines": [
						"Created React/Vite application scaffolding to kickstart development on a new internal tool for an important business initiative.",
						"Contribute to and provide feedback on an internal React component library which is used across a wide array of teams.",
						"Updated backend systems to respect new data contracts related to a new internal tool."
					]
				},
				{
					"line": "Promote web accessibility (a11y) across my team's development work and an internal React component library.",
					"sublines": [
						"Created a pared down version of the Web Content Accessibility Guidelines to create reasonable accessibility targets based on the purpose of our applications.",
						"Teach other engineers about accessible design, semantic HTML, and common accessibility tools such as screen readers and expected web keyboard functionality."
					]
				},
				{
					"line": "Contribute to a robust testing automation codebase which allows anyone to easily script application tests for the frontend."
				}
			]
		},
		{
			"company": "Epic Systems",
			"title": "Full-Stack Software Developer",
			"startDate": {
				"year": 2019,
				"month": 6
			},
			"endDate": {
				"year": 2020,
				"month": 11
			},
			"location": "Madison, WI",
			"descriptions": [
				{
					"line": "Created a new web application for admitting, transferring, and discharging hospital inpatients to make efficient use of hospital bed space."
				},
				{
					"line": "Performed the architecture and development of new features across the frontend and backend."
				},
				{
					"line": "Lead research and development of a brand new product.",
					"sublines": [
						"Remotely communicated designs and collected feedback from the Singapore-based customer."
					]
				},
				{
					"line": "Worked closely with UI/UX design and QA team members to ensure high quality of new functionality and usability while maintaining velocity."
				}
			]
		},
		{
			"company": "CogWorks Lab",
			"title": "AI Programmer/Researcher",
			"startDate": {
				"year": 2017,
				"month": 1
			},
			"endDate": {
				"year": 2019,
				"month": 4
			},
			"location": "Troy, NY",
			"descriptions": [
				{
					"line": "Independent contributor in the Cognitive Science department."
				},
				{
					"line": "Implemented functionality for cross-entropy reinforcement learning (CERL) models that modeled Tetris play to make decisions using information about future tetrominoes."
				},
				{
					"line": "Studied how the CERL models could be used to understand human performance and expertise within Tetris."
				}
			]
		}
	]
}